_Rarzrabotki/Rarus/USO2/AccumulationRegisters/АУН_ПродажиПоАренде.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>АУН_ПродажиПоАренде</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УслугаАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектАренды</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодАренды</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/Периодичность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>Периодичность</Name>
			<Comment>(Упр)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Catalogs/АУН_ОбъектыНедвижимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>АУН_ОбъектыНедвижимости</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерКвартиры</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипНедвижимости</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УПН_ТипыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Этаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектЭксплуатации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыЭксплуатации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АУН_КатегорииОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подъезд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНаименования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеОбъекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_НазначенияОбъектовНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщаяПлощадь</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринадлежитОбъекту</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.АУН_ОбъектыНедвижимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/АУН_ОбщиеПроцедуры/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Для задания обработчиков параметров сеанса следует использовать шаблон:
// Обработчики.Вставить("<ИмяПараметраСеанса>|<НачалоИмениПараметраСеанса*>", "Обработчик");
//
// Примечание. Символ '*'используется в конце имени параметра сеанса и обозначает,
//             что один обработчик будет вызван для инициализации всех параметров сеанса
//             с именем, начинающимся на слово НачалоИмениПараметраСеанса
//
Процедура ОбработчикиИнициализацииПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("АУН_ПравилаДобавленияЭлементовФорм", "АУН_ОбщиеПроцедуры.УстановитьПараметрСеансаПравилаДобавленияЭлементовФорм");
	
КонецПроцедуры

// Процедура устанавливает параметры сеанса в рамках подсистемы АрендаНедвижимости.
Процедура УстановитьПараметрСеансаПравилаДобавленияЭлементовФорм(ИмяПараметра = Неопределено, УстановленныеПараметры = Неопределено) Экспорт
	
	ПравилаДобавленияЭлементовФорм = АУН_МодификацияКонфигурации.ПолучитьПравилаДобавленияЭлементовФорм();
	ПараметрыСеанса.АУН_ПравилаДобавленияЭлементовФорм = Новый ФиксированноеСоответствие(ПравилаДобавленияЭлементовФорм);
	Если УстановленныеПараметры <> Неопределено Тогда 
		УстановленныеПараметры.Добавить("АУН_ПравилаДобавленияЭлементовФорм");
	КонецЕсли;
	
КонецПроцедуры

// Возвращает структуру параметров, необходимых для работы клиентского кода
// при запуске конфигурации, т.е. в обработчиках событий
// - ПередНачаломРаботыСистемы,
// - ПриНачалеРаботыСистемы
//
// Важно: при запуске недопустимо использовать команды сброса кэша
// повторно используемых модулей, иначе запуск может привести
// к непредсказуемым ошибкам и лишним серверным вызовам
//
// Параметры:
//   Параметры - Структура - (возвращаемое значение) структура параметров работы клиента при запуске.
//
// Пример реализации:
//   Для установки параметров работы клиента можно использовать шаблон:
//
//     Параметры.Вставить(<ИмяПараметра>, <код получения значения параметра>);
//
//
Процедура ПараметрыРаботыКлиентаПриЗапуске(Параметры) Экспорт
	
	Если ПользователиКлиентСервер.ЭтоСеансВнешнегоПользователя() Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Переопределяет список команд печати, получаемый функцией УправлениеПечатью.КомандыПечатиФормы.
Процедура ПередДобавлениемКомандПечати(ИмяФормы, КомандыПечати, СтандартнаяОбработка) Экспорт
	
	Если ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента"
		ИЛИ ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаСписка" Тогда
		
		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			 
			// Акт об оказании услуг
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "АктСводный";
			КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг (сводный по услугам)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.Порядок = 14.5;
			
		КонецЕсли;
		
		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			// Счет-фактура
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "СчетФактураСводный";
			КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (сводный по услугам)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВВалюте", Ложь);
			КомандаПечати.Порядок = 20.5;
		КонецЕсли;
		
		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			// Счет-фактура (в валюте)
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "СчетФактураВВалютеСводный";
			КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (сводный по услугам, в валюте)'");
			КомандаПечати.ФункциональныеОпции = "ИспользоватьНесколькоВалют";
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВВалюте", Истина);
			КомандаПечати.Порядок = 21.5;
		КонецЕсли;

	ИначеЕсли ИмяФормы = "Документ.КорректировкаРеализации.Форма.ФормаДокумента" Тогда	
		
		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			
			// Акт об оказании услуг
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "АктСводный";
			КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг (сводный по услугам)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.Порядок = 1.5;
			
		КонецЕсли;
		
		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			// Счет-фактура
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "СчетФактураСводный";
			КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (сводный по услугам)'");
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВВалюте", Ложь);
			КомандаПечати.Порядок = 5.5;	
		КонецЕсли;

		Если Пользователи.РолиДоступны("БазовыеПраваУТ") Тогда
			// Счет-фактура (в валюте)
			КомандаПечати = КомандыПечати.Добавить();
			КомандаПечати.МенеджерПечати = "Обработка.АУН_ПечатьДополнительныхФорм";
			КомандаПечати.Идентификатор = "СчетФактураВВалюте";
			КомандаПечати.Представление = НСтр("ru = 'Счет-фактура (сводный по услугам, в валюте)'");
			КомандаПечати.ФункциональныеОпции = "ИспользоватьНесколькоВалют";
			КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
			КомандаПечати.ДополнительныеПараметры.Вставить("ПечатьВВалюте", Истина);
			КомандаПечати.Порядок = 6.5;	
		КонецЕсли;

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ФормированиеДвижениеДокументов

// Процедура формирует движения документа по указанному регистру
Процедура СформироватьДвиженияПоРегистру(ТаблицаДанных, Движения, ИмяРегистра, Отказ) Экспорт
	
	Если Отказ ИЛИ ТаблицаДанных.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движение = Движения[ИмяРегистра];
	Движение.Записывать = Истина;
	Движение.Загрузить(ТаблицаДанных);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодписокНаСобытие

#Область ОбработкиЗаполнения


#КонецОбласти

#Область ОбработкиПроверкиЗаполнения


#КонецОбласти

#Область ОбработкиПередЗаписью

// Обработчик подписки на событие АУН_ПередЗаписьюЗаказКлиентаРеализация
Процедура ЗаказКлиентаРеализацияПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	МетаданныеДокумента = Источник.Метаданные();
	
	Если (МетаданныеДокумента.Имя = "ЗаказКлиента"
		ИЛИ МетаданныеДокумента.Имя = "РеализацияТоваровУслуг")
		И НЕ Источник.АУН_Аренда Тогда
		
		Для Каждого СтрокаПлатежа Из Источник.Товары Цикл
			СтрокаПлатежа.АУН_ОбъектАренды = Справочники.АУН_ОбъектыНедвижимости.ПустаяСсылка();
			СтрокаПлатежа.АУН_СпособНачисления = Справочники.АУН_СпособыНачисленияАренднойПлаты.ПустаяСсылка();
			СтрокаПлатежа.АУН_СтавкаСпособаНачисления = 0;
			СтрокаПлатежа.АУН_КоличествоДней = 0;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкиПровеведения

// Обработчик подписки на событие АУН_ПроведениеДокументаПоРегиструПродажиАренды
Процедура ПроведениеДокументаПоРегиструПродажиАрендыОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	
	Если НЕ Источник.АУН_Аренда Тогда
		Возврат;
	КонецЕсли;
	
	Движения = Новый Структура;
	
	ДополнительныеСвойства = Новый Структура;
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	Движения.Вставить("ПродажиПоАренде", РегистрыНакопления.АУН_ПродажиПоАренде.СоздатьНаборЗаписей());
	Движения.ПродажиПоАренде.Отбор.Регистратор.Установить(Источник.Ссылка);
	
	ТаблицаНабора = Движения.ПродажиПоАренде.ВыгрузитьКолонки();
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ПродажиПоАренде", ТаблицаНабора);
	
	РеализацияИнициализироватьДанныеДляПроведенияПродажиПоАренде(Источник.Ссылка, ДополнительныеСвойства);
	
	Движения.ПродажиПоАренде.Загрузить(ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажиПоАренде);
	
	ЗаписатьНаборыЗаписей(Движения);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти


#Область РаботаСПериодомАренды

// Функция возвращает начало стандартного периода по выбранной дате
// Параметры:
//		Дата - исходная дата в периоде
//		Договор - договор контрагента, по которому выбираются данные о периодичности.
Функция ОпределитьНачалоПериодаОплатыПоДоговору(Дата, ЗаказКлиента) Экспорт
	
	НачалоПериода = НачалоМесяца(Дата);
	Возврат НачалоПериода;
		
КонецФункции

// Фукнция добавляет стандартный период к определенной дате. Возвращает новый период
// Параметры:
//		ПериодНач - исходная дата
// 		Период - одно из перечислений (Год, Полугодие, Квартал, Месяц, Неделя, День)
// 		Количество - количество периодов.
Функция ДобавитьПериод(ПериодНач,Период,Количество) Экспорт
	
	ОдинДень = 60*60*24;
	
	Если Период = Перечисления.Периодичность.Год Тогда
		Возврат ДобавитьМесяц(ПериодНач,12*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Полугодие Тогда
		Возврат ДобавитьМесяц(ПериодНач,6*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Квартал Тогда
		Возврат ДобавитьМесяц(ПериодНач,3*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Месяц Тогда
		Возврат ДобавитьМесяц(ПериодНач,1*Количество);
	ИначеЕсли Период = Перечисления.Периодичность.Неделя Тогда
		Возврат ПериодНач + ОдинДень*7*Количество;
	ИначеЕсли Период = Перечисления.Периодичность.День Тогда
		Возврат ПериодНач + ОдинДень*Количество;
	КонецЕсли;
		
КонецФункции

// Функция возвращает представление периода по периодичности договора
Функция ПолучитьПредставлениеПериода(Период, Договор) Экспорт
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Возврат "";
	КонецЕсли;
	
	Периодичность = Перечисления.Периодичность.Месяц;
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		НачалоПериода = НачалоГода(Период);
		КонецПериода = КонецГода(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		НачалоПериода = НачалоКвартала(Период);
		КонецПериода = КонецКвартала(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		НачалоПериода = НачалоМесяца(Период);
		КонецПериода = КонецМесяца(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.День Тогда
		НачалоПериода = НачалоДня(Период);
		КонецПериода = КонецДня(Период);
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Если Месяц(НачалоПериода)<7 Тогда
			НачалоПериода = НачалоГода(Период);
			КонецПериода = ДобавитьМесяц(НачалоГода(Период),6) - 1;
		Иначе
			НачалоПериода = ДобавитьМесяц(НачалоГода(Период),6);
			КонецПериода = КонецГода(Период);
		КонецЕсли;
	ИначеЕсли Периодичность= Перечисления.Периодичность.Неделя Тогда
		НачалоПериода = НачалоНедели(Период);
		КонецПериода = КонецНедели(Период);
	КонецЕсли;

	Возврат ПредставлениеПериода(НачалоПериода, КонецПериода);
	
КонецФункции

// Функция возвращает соответсвующий вид периода для выбранной периодичности
Функция ПолучитьВидПериодаПоПериодичности(Периодичность) Экспорт
	
	Если Периодичность = Перечисления.Периодичность.Год Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Год;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Полугодие Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Полугодие;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Квартал Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Квартал;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Месяц Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Месяц;
	ИначеЕсли Периодичность = Перечисления.Периодичность.Неделя Тогда
		Возврат Перечисления.ДоступныеПериодыОтчета.Неделя;
	Иначе
		Возврат Перечисления.ДоступныеПериодыОтчета.День;
	КонецЕсли;

КонецФункции

// Процедура устанавливает в документе вид периода
Процедура ЗаполнитьПериодПоУмолчанию(ДокументОбъект, УстанавливатьВидПериода = Ложь) Экспорт
	
	КоллекцияРеквизитов = АУН_ОбщиеПроцедурыКлиентСервер.ПолучитьКоллекциюРеквизитов(ДокументОбъект);
	
	Периодичность = Перечисления.Периодичность.Месяц;
	Если УстанавливатьВидПериода Тогда
		ДокументОбъект[КоллекцияРеквизитов.ВидПериода] = ПолучитьВидПериодаПоПериодичности(Периодичность);
	КонецЕсли;
	ДокументОбъект[КоллекцияРеквизитов.НачалоПериода] = АУН_ПроцедурыНачисления.НачалоПериода(ТекущаяДата(), Периодичность);
	ДокументОбъект[КоллекцияРеквизитов.ОкончаниеПериода] = АУН_ПроцедурыНачисления.КонецПериода(ТекущаяДата(), Периодичность);
		
КонецПроцедуры

// Функция определяет отношение выбранного интервала к периодичности
Функция ПолучитьКоэффициентПересчетаДней(НачалоПериода, КонецПериода, ПериодНачисления) Экспорт
	
	КоличествоВремени = (НачалоДня(КонецПериода) - НачалоДня(НачалоПериода)) / 86400 + 1; //количество дней
	
	Если ПериодНачисления = Перечисления.Периодичность.Неделя Тогда
		Коэффициент = КоличествоВремени / 7;
	ИначеЕсли ПериодНачисления = Перечисления.Периодичность.День Тогда
		Коэффициент = КоличествоВремени;
	Иначе
		Если ПериодНачисления = Перечисления.Периодичность.Месяц Тогда
			КоличествоМесяцев = 1;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Квартал Тогда
			КоличествоМесяцев = 3;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Полугодие Тогда
			КоличествоМесяцев = 6;
		ИначеЕсли ПериодНачисления = Перечисления.Периодичность.Год Тогда
			КоличествоМесяцев = 12;
		Иначе
			КоличествоМесяцев = 1;
		КонецЕсли;
			
		Если НачалоДня(НачалоПериода) = НачалоМесяца(НачалоПериода) И 
			НачалоДня(КонецПериода) = НачалоДня(КонецМесяца(НачалоПериода)) Тогда
			Коэффициент = 1/КоличествоМесяцев;
		ИначеЕсли НачалоДня(НачалоПериода) = НачалоГода(НачалоПериода) И 
			КонецДня(КонецПериода) = КонецГода(КонецПериода) Тогда
			Коэффициент = (Год(КонецПериода) - Год(НачалоПериода) + 1) * 12 / КоличествоМесяцев;
		Иначе
			Коэффициент = КоличествоВремени /(День(КонецМесяца(НачалоПериода)) * КоличествоМесяцев);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

#КонецОбласти

#Область РаботаСГрафикомСтавок

// Функция возвращает числовое значение ставки аренды. 
// Если Ставка задана графиком, то возвращает значение ставки на дату.
Функция ПолучитьСтавку(Ставка, Дата = '00010101') Экспорт
	
	Возврат Ставка;
	
КонецФункции

// Функция возвращает строковое значение ставки аренды. Если Ставка задана графиком,
// то возвращает представление графика в установленном формате.
Функция ПолучитьСтавкуПрописью(Ставка, Дата = '00010101') Экспорт
	
	Возврат Ставка;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция возвращает значение константы по имени
Функция ПолучитьЗначениеКонстанты(ИмяКонстанты) Экспорт
	
	Возврат Константы[ИмяКонстанты].Получить();
	
КонецФункции

// Функция возвращает состав реквизитов ссылки
Функция ПрочитатьДанныеОбъекта(ДокументОбъект, ПривестиКСтандартнымИменам = Ложь) Экспорт
	
	МетаданныеДокумента = ДокументОбъект.Ссылка.Метаданные();
	
	ДанныеОбъекта  = Новый Структура;
	Для Каждого Реквизит Из МетаданныеДокумента.Реквизиты Цикл
		ДанныеОбъекта.Вставить(Реквизит.Имя, ДокументОбъект[Реквизит.Имя]);
	КонецЦикла;
	Для Каждого Реквизит Из МетаданныеДокумента.СтандартныеРеквизиты Цикл
		ДанныеОбъекта.Вставить(Реквизит.Имя, ДокументОбъект[Реквизит.Имя]);
	КонецЦикла;
	
	Если ПривестиКСтандартнымИменам Тогда
		КоллекцияРеквизитов = АУН_ОбщиеПроцедурыКлиентСервер.ПолучитьКоллекциюРеквизитов(ДокументОбъект);
		АУН_ОбщиеПроцедурыКлиентСервер.ПривестиСтруктуруДанныхКСтандартнымИменам(ДанныеОбъекта, КоллекцияРеквизитов);
	КонецЕсли;
	
	Возврат ДанныеОбъекта;
	
КонецФункции

Процедура РеализацияИнициализироватьДанныеДляПроведенияПродажиПоАренде(Ссылка, ДополнительныеСвойства)
	
	////////////////////////////////////////////////////////////////////////////
	// Создадим запрос инициализации движений
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ДанныеШапки.Дата КАК Период,
	|	ДанныеШапки.Организация,
	|	ДанныеШапки.Договор,
	|	ДанныеШапки.Контрагент,
	|	ДанныеШапки.ВалютаВзаиморасчетов,
	|	ДанныеШапки.АУН_НачалоПериода,
	|	ДанныеШапки.АУН_ОкончаниеПериода
	|ИЗ
	|	Документ.РеализацияТоваровУслуг КАК ДанныеШапки
	|ГДЕ
	|	ДанныеШапки.Ссылка = &Ссылка";
	Реквизиты = Запрос.Выполнить().Выбрать();
	Реквизиты.Следующий();
	
	Запрос.УстановитьПараметр("Период",          	Реквизиты.Период);
	Запрос.УстановитьПараметр("Организация",     	Реквизиты.Организация);
	Запрос.УстановитьПараметр("Договор",  			Реквизиты.Договор);
	Запрос.УстановитьПараметр("Контрагент",  		Реквизиты.Контрагент);
	Запрос.УстановитьПараметр("НачалоПериода", 		Реквизиты.АУН_НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", 	Реквизиты.АУН_ОкончаниеПериода);
	
	СтруктураКурса = АУН_ПроцедурыНачисления.ПолучитьКурсВалюты(Реквизиты.ВалютаВзаиморасчетов, Реквизиты.Период, Реквизиты.Договор);
	Запрос.УстановитьПараметр("КурсДокумента",		СтруктураКурса.Курс);
	Запрос.УстановитьПараметр("КратностьДокумента",	СтруктураКурса.Кратность);
	
	ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
	СтруктураКурса = АУН_ПроцедурыНачисления.ПолучитьКурсВалюты(ВалютаУпр, Реквизиты.Период, Реквизиты.Договор);
	Запрос.УстановитьПараметр("КурсУпр", 			СтруктураКурса.Курс);
	Запрос.УстановитьПараметр("КратностьУпр", 		СтруктураКурса.Кратность);
	
	////////////////////////////////////////////////////////////////////////////
	// Сформируем текст запроса
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	&Период КАК Период,
	|	ТаблицаДокумента.НомерСтроки,
	|	&Ссылка КАК Ссылка,
	|	&Организация КАК Организация,
	|	&Контрагент КАК Контрагент,
	|	&Договор КАК Договор,
	|	ТаблицаДокумента.Номенклатура КАК УслугаАренды,
	|	ТаблицаДокумента.АУН_ОбъектАренды КАК ОбъектАренды,
	|	&НачалоПериода КАК ПериодАренды,
	|	ТаблицаДокумента.СуммаВзаиморасчетов * &КурсДокумента * &КратностьУпр / (&КурсУпр * &КратностьДокумента) КАК Сумма
	|ИЗ
	|	Документ.РеализацияТоваровУслуг.Товары КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначенияБПВызовСервера.ТекстРазделителяЗапросовПакета();
	
	ТекстыЗапроса = Новый СписокЗначений;
	ТекстыЗапроса.Добавить(ТекстЗапроса, "ПродажиПоАренде");
	
	ПроведениеСерверУТ.ИнициализироватьТаблицыДляДвижений(Запрос, ТекстыЗапроса, ДополнительныеСвойства.ТаблицыДляДвижений);
	
КонецПроцедуры

Процедура ЗаписатьНаборыЗаписей(СтруктураНаборыЗаписей)
	
	Для Каждого СтрокаСтруктуры Из СтруктураНаборыЗаписей Цикл
		
		НаборЗаписей = СтрокаСтруктуры.Значение;
		Если НаборЗаписей <> Неопределено И НаборЗаписей.Количество() > 0 Тогда
			НаборЗаписей.Записать();
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Функция возвращает число, соответствуещее цвету переданному в формате "R,G,B"
Функция ПолучитьЦвет(знач ЦветСтрока) Экспорт
	
	Если Не ЗначениеЗаполнено(ЦветСтрока) Тогда
		Возврат 255 + 255*256;
	Иначе
		Ном = Найти(ЦветСтрока, ",");
		КрасныйСтрока = Лев(ЦветСтрока, Ном - 1);
		Строка = Сред(ЦветСтрока, Ном + 1);
		Красный = Число(КрасныйСтрока);
		Ном = Найти(Строка, ",");
		ЗеленыйСтрока = Лев(Строка, Ном - 1);
		Строка = Сред(Строка, Ном + 1);
		Зеленый = Число(ЗеленыйСтрока);
		Синий = Число(Строка);
		Возврат Синий * 256 * 256 + Зеленый * 256 + Красный;
	КонецЕсли;
	
КонецФункции

Процедура СвернутьТаблицуЗначений(Таблица, СписокРесурсов, ИсключаемыеПоля = "") Экспорт
	
	СтруктураРесурсов = Новый Структура(СписокРесурсов);
	СтруктураИсключаемыхПолей = Новый Структура(ИсключаемыеПоля);
	
	СписокИзмерений = "";
	Для Каждого Колонка Из Таблица.Колонки Цикл
		Если СтруктураРесурсов.Свойство(Колонка.Имя) ИЛИ СтруктураИсключаемыхПолей.Свойство(Колонка.Имя) Тогда
			Продолжить;
		КонецЕсли;
		СписокИзмерений = СписокИзмерений + ?(ЗначениеЗаполнено(СписокИзмерений), ",", "") + Колонка.Имя;
	КонецЦикла;
	
	Таблица.Свернуть(СписокИзмерений, СписокРесурсов);
	
КонецПроцедуры

#КонецОбласти
